## LeetCode ==> Second highest salary.

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'salary': [100, 100, 200, 300]
})

In [4]:
df

   id  salary
0   1     100
1   2     100
2   3     200
3   4     300

In [5]:
employee = df.salary.drop_duplicates().sort_values(ascending=False)

In [6]:
employee

3    300
2    200
0    100
Name: salary, dtype: int64

In [7]:
employee.iloc[2]

np.int64(100)

In [8]:
if len(employee) < 2:
    hv = None
else:
    hv = employee.iloc[1]

In [9]:
hv

np.int64(200)

### Department highest salary

In [10]:
employee_data = {
    'id': [1, 2, 3, 4, 5],
    'name': ['Joe', 'Jim', 'Henry', 'Sam', 'Max'],
    'salary': [70000, 90000, 80000, 60000, 90000],
    'departmentId': [1, 1, 2, 2, 1]
}

employee = pd.DataFrame(employee_data)

department_data = {
    'id': [1, 2],
    'name': ['IT', 'Sales']
}
department = pd.DataFrame(department_data)

In [11]:
employee

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [12]:
employee.groupby("departmentId")["salary"].sum()

departmentId
1    250000
2    140000
Name: salary, dtype: int64

In [13]:
department

   id   name
0   1     IT
1   2  Sales

In [14]:
df = employee.merge(department,left_on="departmentId",right_on="id",suffixes=("_em","_de"))
df

   id_em name_em  salary  departmentId  id_de name_de
0      1     Joe   70000             1      1      IT
1      2     Jim   90000             1      1      IT
2      3   Henry   80000             2      2   Sales
3      4     Sam   60000             2      2   Sales
4      5     Max   90000             1      1      IT

In [15]:
max_salary = df.groupby("name_de")["salary"].agg(max)
max_salary.reset_index()

C:\Users\ShahriarHA\AppData\Local\Temp\ipykernel_4268\1307379054.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  max_salary = df.groupby("name_de")["salary"].agg(max)

  name_de  salary
0      IT   90000
1   Sales   80000

In [16]:
max_salary_re = max_salary.reset_index()
max_salary_re

  name_de  salary
0      IT   90000
1   Sales   80000

In [17]:
result = df.merge(max_salary_re,on=["name_de","salary"])
result

   id_em name_em  salary  departmentId  id_de name_de
0      2     Jim   90000             1      1      IT
1      3   Henry   80000             2      2   Sales
2      5     Max   90000             1      1      IT

In [18]:
result[["name_de","name_em","salary"]].set_axis(["Department","Employee","Salary"],axis=1)

  Department Employee  Salary
0         IT      Jim   90000
1      Sales    Henry   80000
2         IT      Max   90000

### Rank Scores

In [19]:
data = {
    'id': [1, 2, 3, 4, 5, 6],
    'score': [3.50, 3.65, 4.00, 3.85, 4.00, 3.65]
}
scores_df = pd.DataFrame(data)
scores_df

   id  score
0   1   3.50
1   2   3.65
2   3   4.00
3   4   3.85
4   5   4.00
5   6   3.65

In [20]:
sorted_scores_df = scores_df.sort_values(by="score",ascending=False)
sorted_scores_df

   id  score
4   5   4.00
2   3   4.00
3   4   3.85
1   2   3.65
5   6   3.65
0   1   3.50

In [21]:
sorted_scores_df["rank"] = sorted_scores_df.score.rank(method='dense',ascending=False)
sorted_scores_df

   id  score  rank
4   5   4.00   1.0
2   3   4.00   1.0
3   4   3.85   2.0
1   2   3.65   3.0
5   6   3.65   3.0
0   1   3.50   4.0

In [22]:
sorted_scores_df["rank"] = sorted_scores_df["rank"].astype(int)

In [23]:
sorted_scores_df

   id  score  rank
4   5   4.00     1
2   3   4.00     1
3   4   3.85     2
1   2   3.65     3
5   6   3.65     3
0   1   3.50     4

In [24]:
sorted_scores_df[["score","rank"]]

   score  rank
4   4.00     1
2   4.00     1
3   3.85     2
1   3.65     3
5   3.65     3
0   3.50     4

### Count Salary Ctegories

In [25]:
accounts = pd.DataFrame({
    'account_id': [3, 2, 8, 6],
    'income': [108939, 12747, 87709, 91796]
})
accounts

   account_id  income
0           3  108939
1           2   12747
2           8   87709
3           6   91796

In [26]:
# def count_category(x):
#     if x < 20000:
#         return 
#     # elif :
#     #     return "Average Salary"
#     # else:
#     #     return "High Salary"

In [27]:
# accounts["category"] = accounts.income.apply(select_category)
accounts["Low Salary"] = accounts.income.apply(lambda x: 1 if x < 20000 else 0)
accounts["Average Salary"] = accounts.income.apply(lambda x: 1 if (x >= 20000) and (x <= 50000) else 0)
accounts["High Salary"] = accounts.income.apply(lambda x: 1 if x > 50000 else 0)

In [28]:
accounts

   account_id  income  Low Salary  Average Salary  High Salary
0           3  108939           0               0            1
1           2   12747           1               0            0
2           8   87709           0               0            1
3           6   91796           0               0            1

In [29]:
melted_account = pd.melt(accounts,id_vars="income",value_vars=["Low Salary","Average Salary","High Salary"],var_name="category",value_name="accounts_count")

In [30]:
melted_account

    income        category  accounts_count
0   108939      Low Salary               0
1    12747      Low Salary               1
2    87709      Low Salary               0
3    91796      Low Salary               0
4   108939  Average Salary               0
5    12747  Average Salary               0
6    87709  Average Salary               0
7    91796  Average Salary               0
8   108939     High Salary               1
9    12747     High Salary               0
10   87709     High Salary               1
11   91796     High Salary               1

In [31]:
res = melted_account.groupby("category")["accounts_count"].agg(sum).reset_index()

C:\Users\ShahriarHA\AppData\Local\Temp\ipykernel_4268\4025551779.py:1: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  res = melted_account.groupby("category")["accounts_count"].agg(sum).reset_index()

In [32]:
res

         category  accounts_count
0  Average Salary               0
1     High Salary               3
2      Low Salary               1

### Find total time spent by employee

In [33]:
employees = pd.DataFrame({
    'emp_id': [1, 1, 1, 2, 2],
    'event_day': ['2020-11-28', '2020-11-28', '2020-12-03', '2020-11-28', '2020-12-09'],
    'in_time': [4, 55, 1, 3, 47],
    'out_time': [32, 200, 42, 33, 74]
})
employees

   emp_id   event_day  in_time  out_time
0       1  2020-11-28        4        32
1       1  2020-11-28       55       200
2       1  2020-12-03        1        42
3       2  2020-11-28        3        33
4       2  2020-12-09       47        74

In [37]:
re_employ = employees.groupby(["event_day","emp_id"])[["in_time","out_time"]].sum().reset_index()

In [38]:
re_employ

    event_day  emp_id  in_time  out_time
0  2020-11-28       1       59       232
1  2020-11-28       2        3        33
2  2020-12-03       1        1        42
3  2020-12-09       2       47        74

In [41]:
re_employ["total_time"] = re_employ.out_time - re_employ.in_time

In [42]:
re_employ

    event_day  emp_id  in_time  out_time  total_time
0  2020-11-28       1       59       232         173
1  2020-11-28       2        3        33          30
2  2020-12-03       1        1        42          41
3  2020-12-09       2       47        74          27

In [44]:
re_employ[["event_day","emp_id","total_time"]].set_axis(["day","emp_id","total_time"],axis=1)

          day  emp_id  total_time
0  2020-11-28       1         173
1  2020-11-28       2          30
2  2020-12-03       1          41
3  2020-12-09       2          27

### Game play analysis 1

In [45]:
activity = pd.DataFrame({
    'player_id': [1, 1, 2, 3, 3],
    'device_id': [2, 2, 3, 1, 4],
    'event_date': ['2016-03-01', '2016-05-02', '2017-06-25', '2016-03-02', '2018-07-03'],
    'games_played': [5, 6, 1, 0, 5]
})
activity

   player_id  device_id  event_date  games_played
0          1          2  2016-03-01             5
1          1          2  2016-05-02             6
2          2          3  2017-06-25             1
3          3          1  2016-03-02             0
4          3          4  2018-07-03             5

In [54]:
re_ac = activity.sort_values(by="event_date").drop_duplicates(subset=["player_id"],keep="first")

In [56]:
re_ac[["player_id","event_date"]].set_axis(["player_id","first_login"],axis=1)

   player_id first_login
0          1  2016-03-01
3          3  2016-03-02
2          2  2017-06-25